read_verilog -sv -formal -overwrite {workspace}/digital/template/user/src/cordic_serial.v
design -reset-vlog; proc;
write_json {workspace}/netlist/cordic_serial.json