read_verilog -sv -formal -overwrite {workspace}/user/src/cordic_serial.v
design -reset-vlog; proc;
write_json {workspace}/prj/netlist/cordic_serial.json