read_verilog -sv -formal -overwrite {workspace}/user/src/cordic_serial.v
read_verilog -sv -formal -overwrite {workspace}/user/sim/tb_cordic_serial.v
design -reset-vlog; proc;
write_json {workspace}/prj/netlist/tb_cordic_serial.json